# 水分限制-GPP
abstract type AbstractHydroModel{FT} <: AbstractModel{FT} end

@bounds @units @with_kw mutable struct XAJ{FT} <: AbstractHydroModel{FT}
  K::FT = 0.0 | (0.1, 1.5) | "-"      # 蒸发折算系数
  B::FT = 0.0 | (0.1, 0.4) | "-"      # 蓄水容量曲线的指数参数
  IM::FT = 0.0 | (0.01, 0.1) | "-"    # 不透水面积比例
  UM::FT = 0.0 | (5.0, 20.0) | "mm"   # 上层土壤平均蓄水容量
  LM::FT = 0.0 | (60.0, 90.0) | "mm"  # 下层
  DM::FT = 0.0 | (60.0, 120.0) | "mm" # 深层
  C::FT = 0.0 | (0.9, 1.1) | "-"      # 深层蒸发系数
  SM::FT = 0.0 | (10.0, 25.0) | "mm"  # 表层自由水蓄水容量
  EX::FT = 0.0 | (1.0, 1.5) | "-"     # 自由水蓄水容量曲线指数
  KI::FT = 0.0 | (0.01, 0.7) | "-"    # 壤中流出流系数
  KG::FT = 0.0 | (0.01, 0.7) | "-"    # 地下水出流系数
  L::FT = 0.0 | (0.0, 5.0) | "-"      # 特征河长？
  CS::FT = 0.0 | (0.01, 0.9) | "-"    # 汇流参数
  CI::FT = 0.0 | (0.5, 0.99) | "-"    # 壤中流，线性水库汇流参数
  CG::FT = 0.0 | (0.95, 0.998) | "-"  # 地下径流，线性水库汇流参数
end

